title: Suspicious Shells by Java
id: 5d0292e6-0fe3-41c8-b8c4-e345009a9150
status: experimental
description: Detects suspicious shells spawned from Java host process (e.g. log4j exploitation)
references:
    - https://socprime.com/blog/cve-2021-45046-cve-2021-44228-detection-vulnerabilities-in-log4j-java-library/
author: Siva Gunasekaran (C0NQU15T4D0R)
date: 2026-03-11
modified: 2026-03-11
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.initial-access
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\java.exe'
        Image|endswith:
            - '\sh.exe'
            - '\bash.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\schtasks.exe'
            - '\certutil.exe'
            - '\whoami.exe'
            - '\bitsadmin.exe'
            - '\wscript.exe'
            - '\cscript.exe'
            - '\scrcons.exe'
            - '\regsvr32.exe'
            - '\hh.exe'
            - '\wmic.exe'
            - '\mshta.exe'
            - '\rundll32.exe'
            - '\forfiles.exe'
            - '\scriptrunner.exe'
            - '\mftrace.exe'
            - '\AppVLP.exe'
            - '\curl.exe'
    condition: selection
falsepositives:
    - Legitimate calls to the system binaries
    - Company specific internal usage
level: high
